app/Controllers/Calendar.php

SELECT *
FROM `vendas`
---
    public function index()
    {

        $data =[
            'title' => 'Calendar',
            'page' => 'Calendar'
        ];

        $vendas = new VendasModel();


        $products = $vendas->findAll();