app/Controllers/Calendar.php

SELECT *
FROM `products`
---
    public function index()
    {

        $data =[
            'title' => 'Calendar',
            'page' => 'Calendar'
        ];

        $product_model = new ProductModel();


        $products = $product_model->findAll();