app/Controllers/Cart.php

    public function add()
    {

        $data = [
            'title' => 'Produtos disponiveis',
            'page' => 'Produtos disponiveis',
        ];
        $data['validation_errors'] = session()->getFlashdata('validation_errors');
        //get product stock
        $product_model = new ProductModel();
        $data['products'] = $product_model->findAll();
---
SELECT *
FROM `products`

public function limpar()
{
    // Recupera os dados da sessão cart
    $cart = session()->get('cart');
    $total = session()->get('total_carrinho');
    $user_id = session()->user['id'];


    if ($cart) {
        // Carrega o model de Vendas
        $vendasModel = new VendasModel();

        // Itera sobre os itens do carrinho e insere na tabela vendas
        foreach ($cart as $item) {
            // Verifica se os dados do item do carrinho são válidos
            if (!empty($item['product_id']) && $item['quantity'] > 0 && $item['subtotal'] > 0) {
                $vendaData = [
                    'user_id'    => $user_id,
                    'quantidade' => $item['quantity'],
                    'valor'      => $total,
                    'created_at' => date('Y-m-d H:i:s'),
                    'updated_at' => date('Y-m-d H:i:s'),

                ];

                $vendasModel->insert($vendaData);
---
INSERT INTO `vendas` (`user_id`, `product_id`, `quantidade`, `valor`, `created_at`, `updated_at`) VALUES ('1', '1', 4, 7999.96, '2024-05-14 23:51:33', '2024-05-14 23:51:33')