app/Controllers/Products.php

SELECT *
FROM `products`
---
    public function index()
    {

        $data = [
            'title' => 'Products',
            'page' => 'Products',

        ];
        //get products]
        $product_model = new ProductModel();

        $data['products'] = $product_model->findAll();

SELECT DISTINCT `category`
FROM `products`
SELECT DISTINCT `marca`
FROM `products`
SELECT DISTINCT `color`
FROM `products`
---
    public function new_product()
    {

        $data = [
            'title' => 'Products',
            'page' => 'Cadastro de produto',

        ];
        $data['validation_errors'] = session()->getFlashdata('validation_errors');

        //carrega categoria
        $product_model = new ProductModel();
        $data['categories'] = $product_model->select('category')->distinct()->findAll();
        $data['marcas'] = $product_model->select('marca')->distinct()->findAll();
        $data['cores'] = $product_model->select('color')->distinct()->findAll();

SELECT *
FROM `products`
WHERE `name` = 'Pneu pirelli'
 LIMIT 1
---

        $products_model = new ProductModel();
        //checar se existe produto
        $product = $products_model->where('name', $this->request->getPost('name'))->first();

INSERT INTO `products` (`name`, `price`, `category`, `marca`, `stock`, `promotion`, `stock_min`, `image`, `inicial_promotion_date`, `final_promotion_date`, `created_at`, `updated_at`) VALUES ('Pneu pirelli', '250.49', 'Pneus', 'Pirelli', '24', '20', '50', 'shopping (2).webp', '', '', '2024-05-15 03:10:44', '2024-05-15 03:10:44')
---
            'final_promotion_date' => $this->request->getPost('data_final')
        ];
        //insert
        $products_model->insert($data);

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
SELECT DISTINCT `category`
FROM `products`
SELECT DISTINCT `marca`
FROM `products`
SELECT DISTINCT `color`
FROM `products`
---
    public function edit($id)
    {
        $data = [
            'title' => 'Products',
            'page' => 'Edição  de produto',
                ];
        $data['validation_errors'] = session()->getFlashdata('validation_errors');
        $product_model = new ProductModel();
        $data['product'] = $product_model->find($id);

        //carrega categoria
        $data['categories'] = $product_model->select('category')->distinct()->findAll();
        $data['marcas'] = $product_model->select('marca')->distinct()->findAll();
        $data['cores'] = $product_model->select('color')->distinct()->findAll();

SELECT *
FROM `products`
WHERE `name` = 'Vela'
AND `id` != '1'
 LIMIT 1
---
        $products_model = new ProductModel();

        //checar se existe produto
        $product = $products_model->where('name', $this->request->getPost('name'))->where('id != ', $this->request->getPost('id_product'))->first();

UPDATE `products` SET `name` = 'Vela', `price` = '299.99', `category` = 'outros', `marca` = 'metal leve', `promotion` = '2', `stock_min` = '100', `image` = 'shopping (3).webp', `updated_at` = '2024-05-15 03:08:15'
WHERE `products`.`id` IN ('1')
---
            $data['image'] = $file_img->getName();
        }

        $products_model->update($id ,$data);