app/Controllers/Stock.php

SELECT *
FROM `products`
---
    public function index()
    {
        $data = [
            'title' => 'Estoque',
            'page' => 'Estoque',

        ];
        //get all products]
        $product_model = new ProductModel();
        $data['products'] = $product_model->findAll();